Revit 2027 API
BuiltInFailures.FamilyFailures.CannotChangeInstFam Property
 Can't change Instance's Family. Try changing Instance's Host to a Level first.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeInstFam { get; }
Public Shared ReadOnly Property CannotChangeInstFam As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeInstFam {
	FailureDefinitionId^ get ();
}
static member CannotChangeInstFam : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace